In [2]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-06  1.048125 -0.667735  0.616679  0.675535

In [10]:
df2 = pd.DataFrame(
     {
         "A":1.0,
         "B":pd.Timestamp("20130102"),
         "C":pd.Series(1, index=list(range(4)), dtype="float32"),
         "D":np.array([3] * 4, dtype="int32"),
         "E":pd.Categorical(["test", "train", "test", "train"]),
         "F":"foo",
     }
 )
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-05  1.065171  0.175148  0.228500  0.012247

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-06  1.048125 -0.667735  0.616679  0.675535

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[-1.09477899,  0.15209557, -0.49630315, -2.07388094],
       [ 0.70718826, -0.28337649, -0.48970477, -0.78206848],
       [ 0.52542483,  0.49240468, -2.08547464, -0.2357024 ],
       [ 0.55137628, -1.51877209, -0.47991219, -1.328393  ],
       [ 1.06517135,  0.17514792,  0.22849959,  0.01224698],
       [ 1.04812486, -0.66773474,  0.61667935,  0.67553483]])

In [18]:
df

                   A         B         C         D
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-06  1.048125 -0.667735  0.616679  0.675535

In [19]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.467084 -0.275039 -0.451036 -0.622044
std    0.800361  0.731469  0.924938  0.986678
min   -1.094779 -1.518772 -2.085475 -2.073881
25%    0.531913 -0.571645 -0.494654 -1.191812
50%    0.629282 -0.065640 -0.484808 -0.508885
75%    0.962891  0.169385  0.051397 -0.049740
max    1.065171  0.492405  0.616679  0.675535

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.094779    0.707188    0.525425    0.551376    1.065171    1.048125
B    0.152096   -0.283376    0.492405   -1.518772    0.175148   -0.667735
C   -0.496303   -0.489705   -2.085475   -0.479912    0.228500    0.616679
D   -2.073881   -0.782068   -0.235702   -1.328393    0.012247    0.675535

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -2.073881 -0.496303  0.152096 -1.094779
2013-01-02 -0.782068 -0.489705 -0.283376  0.707188
2013-01-03 -0.235702 -2.085475  0.492405  0.525425
2013-01-04 -1.328393 -0.479912 -1.518772  0.551376
2013-01-05  0.012247  0.228500  0.175148  1.065171
2013-01-06  0.675535  0.616679 -0.667735  1.048125

In [27]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-06  1.048125 -0.667735  0.616679  0.675535
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-03  0.525425  0.492405 -2.085475 -0.235702

In [28]:
df["A"]

2013-01-01   -1.094779
2013-01-02    0.707188
2013-01-03    0.525425
2013-01-04    0.551376
2013-01-05    1.065171
2013-01-06    1.048125
Freq: D, Name: A, dtype: float64

In [32]:
df["B"].name

'B'

In [33]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702

In [35]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393

In [38]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [36]:
df.loc[dates[0]]

A   -1.094779
B    0.152096
C   -0.496303
D   -2.073881
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.094779  0.152096
2013-01-02  0.707188 -0.283376
2013-01-03  0.525425  0.492405
2013-01-04  0.551376 -1.518772
2013-01-05  1.065171  0.175148
2013-01-06  1.048125 -0.667735

In [40]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.707188 -0.283376
2013-01-03  0.525425  0.492405
2013-01-04  0.551376 -1.518772

In [41]:
df.iloc[3]

A    0.551376
B   -1.518772
C   -0.479912
D   -1.328393
Name: 2013-01-04 00:00:00, dtype: float64

In [42]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.551376 -1.518772
2013-01-05  1.065171  0.175148

In [44]:
# 第0，1行， 第3列
df.iloc[0:2, 3:4]

                   D
2013-01-01 -2.073881
2013-01-02 -0.782068

In [45]:
df.iloc[[1, 2, 4], [0, 3]]

                   A         D
2013-01-02  0.707188 -0.782068
2013-01-03  0.525425 -0.235702
2013-01-05  1.065171  0.012247

In [46]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.152096 -0.496303
2013-01-02 -0.283376 -0.489705
2013-01-03  0.492405 -2.085475
2013-01-04 -1.518772 -0.479912
2013-01-05  0.175148  0.228500
2013-01-06 -0.667735  0.616679

In [47]:
df.iloc[1, 1]

-0.2833764855889833

In [48]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-06  1.048125 -0.667735  0.616679  0.675535

In [49]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.152096       NaN       NaN
2013-01-02  0.707188       NaN       NaN       NaN
2013-01-03  0.525425  0.492405       NaN       NaN
2013-01-04  0.551376       NaN       NaN       NaN
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-06  1.048125       NaN  0.616679  0.675535

In [50]:
df

                   A         B         C         D
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068
2013-01-03  0.525425  0.492405 -2.085475 -0.235702
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393
2013-01-05  1.065171  0.175148  0.228500  0.012247
2013-01-06  1.048125 -0.667735  0.616679  0.675535

In [62]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [63]:
df["F"] = s1

In [64]:
df

                   A         B         C         D    F
2013-01-01 -1.094779  0.152096 -0.496303 -2.073881  NaN
2013-01-02  0.707188 -0.283376 -0.489705 -0.782068  1.0
2013-01-03  0.525425  0.492405 -2.085475 -0.235702  2.0
2013-01-04  0.551376 -1.518772 -0.479912 -1.328393  3.0
2013-01-05  1.065171  0.175148  0.228500  0.012247  4.0
2013-01-06  1.048125 -0.667735  0.616679  0.675535  5.0